tutorials/mesh/foamyQuadMesh/OpenCFD/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    box_inlet
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }

    box_outlet
    {
        type            zeroGradient;
    }

    box_bottom
    {
        type            supersonicFreestream;
        UInf            (3 0 0);
        pInf            1;
        TInf            1;
        gamma           1.4;
    }

    box_top
    {
        type            supersonicFreestream;
        UInf            (3 0 0);
        pInf            1;
        TInf            1;
        gamma           1.4;
    }

    letters_text
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
