tutorials/mesh/foamyQuadMesh/OpenCFD/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    box_inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    box_outlet
    {
        type            zeroGradient;
    }

    box_bottom
    {
        type            zeroGradient;
    }

    box_top
    {
        type            zeroGradient;
    }

    letters_text
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
